Autodesk.Revit.DB.ElementSlowFilter
A base class for a type of filter that operates on expanded elements.
Remarks:
Slow filters require that the Element be obtained and expanded in memory first.
Thus it is preferable to couple slow filters with at least one ElementQuickFilter,
which should minimize the number of Elements that are expanded in order to evaluate
against the criteria set by this filter.
Since:
2011